Repository: TwisterMc/wp-delete-post-images
Catalog: languages/wp-delete-post-images-*.po
Languages: es_es

source: Delete Post Media Settings
es_es: Configuración de Eliminación de Medios

source: Delete Post Media
es_es: Eliminar Medios

source: Performance Settings
es_es: Configuración de Rendimiento

source: Control which scans run when checking if an attachment is used elsewhere. Disable heavy scans to improve performance during bulk deletions.
es_es: Controla qué escaneos se ejecutan al verificar si un adjunto se usa en otro lugar. Desactiva los escaneos pesados para mejorar el rendimiento durante eliminaciones masivas.

source: Scan Post Content (REGEXP)
es_es: Escanear Contenido de Entradas (REGEXP)

source: Search for attachment IDs in post content/excerpt using REGEXP (wp-image-, attachment_, Gutenberg JSON, etc.).
es_es: Buscar IDs de adjuntos en contenido/extracto de entradas usando REGEXP (wp-image-, attachment_, JSON de Gutenberg, etc.).

source: Scan Post Content (Filename)
es_es: Escanear Contenido de Entradas (Nombre de Archivo)

source: Search for filename matches in post content/excerpt (covers direct links and sized variants).
es_es: Buscar coincidencias de nombre de archivo en contenido/extracto de entradas (incluye enlaces directos y variantes de tamaño).

source: Scan Postmeta (ID)
es_es: Escanear Postmeta (ID)

source: Search for numeric attachment IDs in postmeta values (including serialized data).
es_es: Buscar IDs numéricos de adjuntos en valores de postmeta (incluyendo datos serializados).

source: Scan Postmeta (URL)
es_es: Escanear Postmeta (URL)

source: Search for attachment URLs in postmeta values (e.g., custom fields, page builders).
es_es: Buscar URLs de adjuntos en valores de postmeta (ej., campos personalizados, constructores de páginas).

source: Deep Scans (Optional)
es_es: Escaneos Profundos (Opcional)

source: These scans search additional database tables. Only enable if you store attachment URLs in these locations. May impact performance on large sites.
es_es: Estos escaneos buscan en tablas adicionales de la base de datos. Activa solo si almacenas URLs de adjuntos en estas ubicaciones. Puede afectar el rendimiento en sitios grandes.

source: Scan Term Meta for URLs
es_es: Escanear Meta de Términos por URLs

source: Search for attachment URLs in term metadata. May impact performance on large sites.
es_es: Buscar URLs de adjuntos en metadatos de términos. Puede afectar el rendimiento en sitios grandes.

source: Scan Options for URLs
es_es: Escanear Opciones por URLs

source: Search for attachment URLs in site options. May impact performance.
es_es: Buscar URLs de adjuntos en opciones del sitio. Puede afectar el rendimiento.

source: Scan Comments for URLs
es_es: Escanear Comentarios por URLs

source: Search for attachment URLs in comment content. May impact performance.
es_es: Buscar URLs de adjuntos en contenido de comentarios. Puede afectar el rendimiento.

source: Supported Post Types
es_es: Tipos de Entrada Admitidos

source: By default, the plugin processes all post types except revisions, nav menu items, and attachments. Select specific post types to limit which posts trigger media cleanup.
es_es: Por defecto, el plugin procesa todos los tipos de entrada excepto revisiones, elementos de menú de navegación y adjuntos. Selecciona tipos de entrada específicos para limitar qué entradas activan la limpieza de medios.

source: Limit to Post Types
es_es: Limitar a Tipos de Entrada

source: Select post types to process
es_es: Selecciona tipos de entrada para procesar

source: No public post types found.
es_es: No se encontraron tipos de entrada públicos.

source: Leave empty to process all post types (except revisions, nav menu items, and attachments).
es_es: Deja vacío para procesar todos los tipos de entrada (excepto revisiones, elementos de menú de navegación y adjuntos).

source: Protected Attachments
es_es: Adjuntos Protegidos

source: Specify attachment IDs that should never be deleted, regardless of usage detection.
es_es: Especifica IDs de adjuntos que nunca deben eliminarse, independientemente de la detección de uso.

source: Protected Attachment IDs
es_es: IDs de Adjuntos Protegidos

source: Enter comma-separated attachment IDs
es_es: Ingresa IDs de adjuntos separados por comas

source: e.g., 123, 456, 789
es_es: ej., 123, 456, 789

source: Enter attachment IDs separated by commas. These attachments will never be deleted by this plugin.
es_es: Ingresa IDs de adjuntos separados por comas. Estos adjuntos nunca serán eliminados por este plugin.

source: Enable
es_es: Activar

source: Settings saved.
es_es: Configuración guardada.

source: Save Settings
es_es: Guardar Configuración

source: How It Works
es_es: Cómo Funciona

source: When a post is permanently deleted, this plugin automatically deletes attached media files—but only if they are not used anywhere else on your site.
es_es: Cuando una entrada se elimina permanentemente, este plugin elimina automáticamente los archivos de medios adjuntos, pero solo si no se usan en ningún otro lugar de tu sitio.

source: Checks Performed
es_es: Verificaciones Realizadas

source: Featured image of another post
es_es: Imagen destacada de otra entrada

source: Site icon or custom logo
es_es: Icono del sitio o logotipo personalizado

source: Referenced in post content/excerpt (IDs, classes, filenames)
es_es: Referenciado en contenido/extracto de entradas (IDs, clases, nombres de archivo)

source: Stored in postmeta (IDs or URLs)
es_es: Almacenado en postmeta (IDs o URLs)

source: Optionally: term meta, options, and comments (if enabled above)
es_es: Opcionalmente: meta de términos, opciones y comentarios (si están activados arriba)

source: The plugin performs conservative checks to avoid accidental data loss. If any check suggests the file may be in use, it will not be deleted.
es_es: El plugin realiza verificaciones conservadoras para evitar la pérdida accidental de datos. Si alguna verificación sugiere que el archivo puede estar en uso, no se eliminará.
